{
    "actions": [
        {
            "ACTIONID": "1",
            "ACTION": "Oh, no!! I paid for this?! This beast is really ugly! Jeezzz...I hope I don't get the clap from this hooker. Well, she seems to be annoyed that I haven't jumped on her yet. Go to it, stud!!"
        },
        {
            "ACTIONID": "2",
            "ACTION": "It's the Gambler's Gazette. There's an article here which tells how to activate the games at the Adventurers Hotel! It says that blackjack can be played by entering 'Play 21.' The slot machines start with 'Play slots!' 21can be beat. The trick is- always play with the blue cards and always bet $2."
        },
        {
            "ACTIONID": "3",
            "ACTION": "Mmmmm....an interesting magazine with a nice centerfold! The feature article is about how to pick up an innocent girl at a disco. It says- 'Shower her with presents. Dancing won't hurt either. And wine is always good to get things moving!'"
        },
        {
            "ACTIONID": "4",
            "ACTION": "Cute and innocent! Just the way I like my women. Oh, this girl is great! She has a beautiful California tan...and pert little breasts...a trim waist...andwell-rounded hips! I dream about getting this nice a girl. I hope you play this game well enough so I can have my jollys with her! You could make your puppet a very happy man!"
        },
        {
            "ACTIONID": "5",
            "ACTION": "What a beautiful face! She's leaning back in the jacuzzi with her eyes closedand seems extremely relaxed. The water is bubbling up around her. A 10! She'sso beautiful...a guy really could fall in love with a girl like this. I presume her name is 'Eve,' at least, that's what the towel next to her has embroidered on it."
        },
        {
            "ACTIONID": "6",
            "ACTION": "A taxi pulls up and screeches to a halt. I get in the back and sit down. Asign says, 'We service 3 destinations. When asked, please specify- disco, casino, or bar.' The driver turns and asks, 'Where to, Mac?'"
        },
        {
            "ACTIONID": "7",
            "ACTION": "The elevator doors open. I get in. As the doors close, music starts playing.It's the usual elevator stuff...boring! We start to move...after a fewseconds the elevator stops. The doors open and I get out."
        },
        {
            "ACTIONID": "8",
            "ACTION": "She says, 'Me first!' She takes my throbbing tool into her mouth! She startsgoing to work...feels so good!! Then she smiles as she bites it off! Shesays, 'No oral sex in this game!! Suffer!!'"
        },
        {
            "ACTIONID": "9",
            "ACTION": "Well, my son...here's my story. I came here many years ago- and my goalswere the same as yours... but this adventure was too much for me! Here's agift...carry it with you at all times!! There's some kinky girls in thistown! And you never know when you may need to use this to defend yourself!!"
        },
        {
            "ACTIONID": "10",
            "ACTION": "She's wearing the tightest jeans! Wow...what a body!! 36-24-35! This girl'sderriere is sensational! And the shirt? See through- and what I see, I like!As my eyes reluctantly roam from her body, I see bright blue eyes- and asmile that dazles me. I think she likes me!"
        },
        {
            "ACTIONID": "11",
            "ACTION": "A masked man runs across the screen. Jumping up, he lands on his horse and yells, 'Hi, ho, Plutonium!' He rides off into a green sky.... Nothing like a good old western to pass the time..."
        },
        {
            "ACTIONID": "12",
            "ACTION": "It's 'The Price is Fright!' 'And now, for our favorite host, Haunty Maule!' Haunty jumps up on the stage- he asks, 'and who's our first lucky contestant?'The announcer points out a lady...the crowd screams in ecstasy as she's dragged to the stage!"
        },
        {
            "ACTIONID": "13",
            "ACTION": "Captain Jerk looks at the door from which behind the noise is coming.Throwing open the door- his face turns a deep red!! He says, 'Scotty! Whatare you doing??' Scotty replies, 'But, Captain?!?! My girl and I...we'reengaged!' Captain Jerk commands, 'Well, then... disengage!' And the starshipthrusts forward...penetrating deeper into space!"
        },
        {
            "ACTIONID": "14",
            "ACTION": "The news! Today the prime rate was raised once again...to 257%! This doesnot come near the record set back in 1996, when it broke the 1000% mark. Thebirth rate has taken a dramatic fall...this is due to the increased usage of computers as sexual partners. However, rapes of innocent people are on the increase! And who is the rapist? Computerized banking machines lead the list...followed by home computers."
        },
        {
            "ACTIONID": "15",
            "ACTION": "Mr. Rodjerks jumps up with his big sneakers and says in his cheery voice...'Guess what, boys and girls? Today, we're going to learn about suckers!Susie...see the lollipop? Can you stick it in your mouth? That's right! That's a nice lollipop! Nice and hard, right?'"
        },
        {
            "ACTIONID": "16",
            "ACTION": "Cable TV! They're showing the kinkiest X-rated movies! This one's titled,'Deep Nostril!' The pimp likes this one! He's engrossed in the action hesees! He seems distracted now..."
        },
        {
            "ACTIONID": "17",
            "ACTION": "It's 'Happy Daze!!' Richie turns to Gonzy and says, 'But you always had itmade with the girls...what's your secret?' The Gonz says, 'Aaayyyy...Ididn't get my name for nuttin!'  Reaching into his pocket he pulls out afunny-looking cigarette."
        },
        {
            "ACTIONID": "18",
            "ACTION": "Mrs. Smith and Mrs. Jones are comparing detergents... 'See this blouse? We'remaking it this dirty to see whose works better...' (A dog is thrown onto theblouse. In his excitement, he defacates all over it.)  'Do you think yours will work, Mrs. Smith?' (The camera pans to Mrs. Smith. She throws up.) 'Okay, how about you, Mrs. Jones?'"
        },
        {
            "ACTIONID": "19",
            "ACTION": "It's the Super Bowl!! 'The center snaps the ball! The quarterback fadesback!! It's a bomb!!! The ball sails through the air. The receiver runs toget it. It explodes in his hands!! What a bomb! Tell me, Howard: Have youever seen THIS before?!'"
        },
        {
            "ACTIONID": "20",
            "ACTION": "She takes the apple and raises it to her mouth. With an outrageously innocent look, she takes a small bite out of it. A smile comes across herface! She's really starting to look quite sexy!! She winks and lies backin the jacuzzi."
        },
        {
            "ACTIONID": "21",
            "ACTION": "It's a good thing I was wearing that rubber!! She was ok- but really...can'tyou do better than this? The score is now 1 out of a possible 3. So,congratulations! Well, go to it, you stud! Find me another girl!"
        },
        {
            "ACTIONID": "22",
            "ACTION": "Oh, boy!! It's got 3 spots to try!! I thrust into the doll-kinky, eh? Istart to increase my tempo...faster and faster I go! Suddenly there'sa flatulent noise and the doll becomes a popped baloon soaring around theroom! It flies out of the room and disappears!"
        },
        {
            "ACTIONID": "23",
            "ACTION": "She hops out of the tub- the steam rising from her skin...her body is thebest looking I've ever seen!! Then she comes up to me and gives the besttime of my life! Well...I guess that's it! As your puppet in this game, Ithank you for the pleasure you have brought me.... So long...I've got to getback to my new girl here! Keep it up!"
        },
        {
            "ACTIONID": "24",
            "ACTION": "She says, 'Lay down, Honey- Let me give you a special surprise!' I lay downand she says, 'OK- now close your eyes.' I close my eyes and she starts togo to work on me. I'm really enjoying myself when suddenly she ties me tothe bed!! Then she says, 'So long, turkey!' and runs out of the room!!Well- the score is now 2 out of a possible 3...but I'm also tied to the bedand can't move."
        },
        {
            "ACTIONID": "25",
            "ACTION": "Mmmmm. This is a peeping tom's paradise! Across the way is another hotel.Ah hah! The curtains are open at one window! The bathroom door opens and agirl walks out. Holy cow! Her boobs are huge- and look at the way they swayas she strides across the room! Now she's taking a large sausage-shapedobject and looking at it longingly! Damn! She shut the curtain!"
        },
        {
            "ACTIONID": "26",
            "ACTION": "This stuff is good!  I'm breathing heavily- I've never been this horny! I've just got to do something! Ah! There goes a female german shepard! That givesme an idea! Kinky dog! Clawed me to death!!!!!"
        },
        {
            "ACTIONID": "27",
            "ACTION": "The blonde looks at the pills and says, 'Thanks! I love this stuff!' She takes a pill...her nipples start to stand up! Wow!! She's breathingheavily...I hope she rapes me!! She says, 'So long, sucker! I'm going to go see my boy friend!' She disappears down the stairs...."
        },
        {
            "ACTIONID": "28",
            "ACTION": "The driver looks at me and says, 'Hey! What's that you got? Wine?' He grabsthe bottle and guzzles the wine down!! Oh, no!! He's swerving towards a hugetruck!! I grab the wheeel. We struggle!!! The truck just misses us!!"
        },
        {
            "ACTIONID": "29",
            "ACTION": "Thy quest is over! Thank you so much for playing! If you like this game and would like to see more by Gary, please register this game by sending $20 tothe address below!  Thanks!\r\n- Gary Thompson\r\n1708 NW 15th CT\r\nFt Lauderdale, FL 33311"
        },
        {
            "ACTIONID": "30",
            "ACTION": "The object of LEISURE SUIT LARRY is to find -- and seduce -- three different girls.\r\nThey have very different personalities, so tricks that work on one girl usually won't work on another girl.\r\nThe game has three different areas -- Disco, Casino and Bar.\r\nYou start off in the Bar with $1,000.\r\nYou'll need more money than that, so you'll have to make more money during the game.\r\nIf you're stuck, try looking at everything in sight, object by object. This will usually help you find missing objects and/or clues etc.\r\nThe 'Help' command will repeat this message.\r\nSeveral commands can be entered on the same line, but must then be separated by commas or periods.\r\n========= ******** GOOD LUCK !!! ******** ========"
        },
        {
            "ACTIONID": "31",
            "ACTION": "Holy Cow!  Psychedelic!!!!\r\nPretty colors appear and I'm elsewhere!"
        },
        {
            "ACTIONID": "32",
            "ACTION": "Welcome to Purgatory!!  Here at this crossroad you have three options:\r\n\r\nBefore you are three doors.  Each will bring you to a different place -\r\nA - To Hell (where the game ends)\r\nB - Back to life, unharmed\r\nC - You stay here and must choose again\r\nThe doors are randomly different each time!!"
        },
        {
            "ACTIONID": "33",
            "ACTION": "Why am I doing this?\r\nThe Preacher takes $1000 and winks!\r\nThe girl grabs $2000 and says:\r\n'Meet me at the Honeymoon Suite!!  I've got connections to get a room there!!'"
        },
        {
            "ACTIONID": "34",
            "ACTION": "Hi there!!!  This is Chuck (the author of this absurd game).  If you're a voluptous blonde who's looking for a good time, then call me immedeatley!!"
        },
        {
            "ACTIONID": "35",
            "ACTION": "A voice answers and says  'Wine for the nervous newlyweds!  Coming right up!!'"
        },
        {
            "ACTIONID": "36",
            "ACTION": "Ok, here goes .......\r\nOh no!!!!  It's overflowing!!!!!!!!!!!!!!!!!\r\nIt's filling the room with gross sewage!!!!!"
        },
        {
            "ACTIONID": "37",
            "ACTION": "You give your puppet commands like 'Go north', 'Buy beer' etc.  A phrase like"
        },
        {
            "ACTIONID": "38",
            "ACTION": "+---------------------------------------------------+\r\n|          For those who desire the best:           |\r\n|    Announcing, the most exclusive, the exciting,  |\r\n|             the hottest spot in town,             |\r\n|            ***************************            |\r\n|            * SWINGING SINGLE'S DISCO *            |\r\n|            ***************************            |\r\n+---------------------------------------------------+"       
        }
    ]
}